import CuentaNavegacion from '@/src/components/CuentaNavegacion/CuentaNavegacion'
import { PlayfairDisplayFont } from '@/src/utils/fonts'


export default function Cuenta() {

  return (
    <main className='max-w-[1200px] mx-auto px-5 m-lg'>

      {/* Icono y título */}
      <div className='flex items-center gap-4'>
        <svg width="32" height="32" viewBox="0 0 27 27" fill="inherit" xmlns="http://www.w3.org/2000/svg">
          <path d="M14.2938 26.9989H12.7122C12.6357 26.9834 12.5591 26.965 12.482 26.9534C11.7458 26.8391 10.9975 26.7775 10.2757 26.6049C3.34904 24.945 -1.11288 17.982 0.242396 10.9724C0.806029 8.05836 2.16629 5.57439 4.35703 3.57823C7.48309 0.730766 11.1767 -0.404667 15.3617 0.126978C18.0279 0.466054 20.3768 1.56042 22.3905 3.34015C24.7627 5.43621 26.2466 8.04449 26.7925 11.1722C26.8813 11.6794 26.9318 12.1933 27 12.7044V14.2871C26.9839 14.3804 26.9639 14.4725 26.9517 14.5663C26.8874 15.0535 26.8497 15.5452 26.7581 16.0275C26.2472 18.7173 25.0234 21.0409 23.1001 22.9838C21.0835 25.021 18.6598 26.3035 15.8289 26.7919C15.3201 26.8796 14.8053 26.9312 14.2938 27V26.9989ZM22.5031 21.254C26.255 17.0952 26.7931 9.66106 21.6078 4.76527C16.6682 0.100895 8.64974 0.620886 4.32097 5.91014C-0.0283253 11.2249 1.41571 17.9709 4.50848 21.234C5.38222 18.1468 7.32609 16.0203 10.299 14.8138C7.17242 12.5657 7.24454 8.53839 9.2744 6.31803C11.3803 4.01442 14.929 3.77912 17.2163 5.81469C18.4545 6.91682 19.1391 8.29699 19.1713 9.95408C19.2107 11.9835 18.3458 13.5901 16.7059 14.8082C19.695 16.0208 21.615 18.1585 22.5031 21.2551V21.254ZM13.5937 25.4156C13.8489 25.4028 14.2001 25.3873 14.5507 25.3651C14.6905 25.3562 14.8292 25.3307 14.9684 25.3135C17.2313 25.0366 19.2395 24.1614 21.0086 22.7307C21.0719 22.6797 21.1207 22.5548 21.109 22.4738C20.5077 18.1713 16.4912 15.2245 12.2285 15.952C8.92601 16.5158 6.39465 19.1169 5.90147 22.4638C5.88871 22.5509 5.94142 22.6852 6.00965 22.7407C8.19484 24.5005 10.6957 25.3806 13.5937 25.4156ZM13.4906 14.2033C15.7323 14.22 17.573 12.3986 17.6046 10.1322C17.6357 7.90297 15.7928 6.03112 13.5421 6.00615C11.2882 5.98062 9.43528 7.80419 9.40199 10.0801C9.36926 12.3215 11.2183 14.1861 13.4906 14.2028V14.2033Z" fill="inherit"/>
        </svg>

        <p className={`${PlayfairDisplayFont.variable} ff-fairplay text-[36px] leading-[36px]`}>Mi cuenta</p>
      </div>

      {/* Fila de nombre completo */}
      <div className='m-lg'>
        <p className='font-bold lg:text-[20px]'>Nombre completo</p>
        <p className='lg:text-[20px]'>Pérez Hernández</p>
      </div>

      {/* Filas de correo electrónico y teléfono */}
      <div className='m-md flex items-center gap-20'>
        <div>
          <p className='font-bold lg:text-[20px]'>Correo electrónico</p>
          <p className='lg:text-[20px]'>Pérez Hernández</p>
        </div>

        <div>
          <p className='font-bold lg:text-[20px]'>Teléfono</p>
          <p className='lg:text-[20px]'>55 7050 7658</p>
        </div>
      </div>

      <div className='m-lg'>
        <CuentaNavegacion />
      </div>
    </main>
  )
}
